       01 WS-GOODS-LIST.
           05 WS-GOOD OCCURS 5.
               10 WS-GOOD-ID        PIC 9(10).
               10 WS-GOOD-NAME      PIC X(20).
               10 WS-GOOD-BASE-PRICE PIC 9(10)V99.

       01 WS-GOODS-PRICES-LIST.
           05 WS-GOODS-PRICES OCCURS 5.
               10 WS-GOODS-PRICES-PORT-ID     PIC 9(10).
               10 WS-GOODS-PRICES-GOOD OCCURS 5.
                   15 WS-GOODS-PRICES-GOOD-ID PIC 9(10).
                   15 WS-GOODS-PRICES-PRICE   PIC 9(10)V99.
