       IDENTIFICATION DIVISION.
       PROGRAM-ID. END-SCREEN.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 WS-RESULT PIC X(10).

       PROCEDURE DIVISION USING WS-RESULT.

           GOBACK.
