//BUILDGAM JOB (001),'BUILD BOAT GAME',CLASS=A,MSGCLASS=X

//BUILDINIT EXEC PGM=IKFCBL00
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DSN=BOATGAME.COPYLIB,DISP=SHR
//SYSLIN    DD  DSN=&&INITOBJ,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,(1,1))
//SYSIN     DD  DSN=BOATGAME.SRC.INIT,DISP=SHR

//BUILDPORT EXEC PGM=IKFCBL00
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DSN=BOATGAME.COPYLIB,DISP=SHR
//SYSLIN    DD  DSN=&&PORTOBJ,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,(1,1))
//SYSIN     DD  DSN=BOATGAME.SRC.PORT,DISP=SHR

//BUILDEND  EXEC PGM=IKFCBL00
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DSN=BOATGAME.COPYLIB,DISP=SHR
//SYSLIN    DD  DSN=&&ENDOBJ,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,(1,1))
//SYSIN     DD  DSN=BOATGAME.SRC.END,DISP=SHR

//BUILDMAIN EXEC PGM=IKFCBL00
//SYSPRINT  DD  SYSOUT=*
//SYSLIB    DD  DSN=BOATGAME.COPYLIB,DISP=SHR
//SYSLIN    DD  DSN=&&GAMEOBJ,DISP=(NEW,PASS),UNIT=VIO,SPACE=(CYL,(1,1))
//SYSIN     DD  DSN=BOATGAME.SRC.GAME,DISP=SHR

//LINK     EXEC PGM=IEWL,COND=((4,GE,BUILDINIT),(4,GE,BUILDPORT),
//             (4,GE,BUILDEND),(4,GE,BUILDMAIN))
//SYSLIN   DD  DSN=&&INITOBJ,DISP=(OLD,DELETE)
//         DD  DSN=&&PORTOBJ,DISP=(OLD,DELETE)
//         DD  DSN=&&ENDOBJ,DISP=(OLD,DELETE)
//         DD  DSN=&&GAMEOBJ,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=BOATGAME.LOADLIB(GAME),DISP=SHR
//SYSPRINT DD  SYSOUT=*

//RUN      EXEC PGM=GAME,COND=(8,GE,LINK)
//STEPLIB  DD  DSN=BOATGAME.LOADLIB,DISP=SHR

